Revit 2026 API

# RebarShapeConstraintSegmentLength Properties

---

The RebarShapeConstraintSegmentLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

#### Reference

RebarShapeConstraintSegmentLength Class

Autodesk.Revit.DB.Structure Namespace